/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Doplněk Telesec";
"06 06 02 82 06 01 0A 01"		= "Mechanismus Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Ověření totožnosti Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Ověření totožnosti heslem";
"06 08 02 82 06 01 0A 01 00 02" = "Chráněné ověření totožnosti heslem";
"06 08 02 82 06 01 0A 01 00 03" = "Jednocestné ověření totožnosti X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Dvoucestné ověření totožnosti X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Trojcestné ověření totožnosti X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Jednocestné ověření totožnosti ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Dvoucestné ověření totožnosti ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Ověření totožnosti Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Podpis Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 s RSA a ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 s RSA a standardem podpisu Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 s RSA a ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 s RSA a standardem podpisu Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 s RSA a standardem podpisu Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Podpis HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Šifrování Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "-";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Jednocestná funkce";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hašování pomocí blokového kódu";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Funkce FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Modul Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritmy";
"06 07 02 82 06 01 0A 02 01"	= "Typy atributů";
"06 07 02 82 06 01 0A 02 02"	= "Typy certifikátů";
"06 07 02 82 06 01 0A 02 03"	= "Typy zprávy";
"06 07 02 82 06 01 0A 02 04"	= "PL protokol";
"06 07 02 82 06 01 0A 02 05"	= "SME a komponenty SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Užitečné definice";
"06 07 02 82 06 01 0A 02 08"	= "Soubory STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Elektronická objednávka";
"06 07 02 82 06 01 0A 02 0B"	= "Asymetrická aplikace Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Základní aplikace Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Zprávy Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Aplikace časové značky Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Objektová třída";
"06 07 02 82 06 01 0A 03 00"	= "Jiné jméno Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Adresář";
"06 07 02 82 06 01 0A 03 02"	= "Typ adresáře";
"06 07 02 82 06 01 0A 03 03"	= "Skupina adresářů";
"06 07 02 82 06 01 0A 03 04"	= "Uživatel adresáře";
"06 07 02 82 06 01 0A 03 05"	= "Záznam symetrického klíče";

"06 06 02 82 06 01 0A 04"		= "Balíček";
"06 06 02 82 06 01 0A 05"		= "Parametr";
"06 06 02 82 06 01 0A 06"		= "Vazba jména";
"06 06 02 82 06 01 0A 07"		= "Atribut";
"06 07 02 82 06 01 0A 07 00"	= "Identifikátor skupiny aplikací";
"06 07 02 82 06 01 0A 07 01"	= "Typ certifikátu";
"06 07 02 82 06 01 0A 07 02"	= "Certifikát Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Číslo certifikátu";
"06 07 02 82 06 01 0A 07 04"	= "Seznam revokovaných certifikátů";
"06 07 02 82 06 01 0A 07 05"	= "Datum vytvoření";
"06 07 02 82 06 01 0A 07 06"	= "Vydavatel";
"06 07 02 82 06 01 0A 07 07"	= "Pojmenovací autorita";
"06 07 02 82 06 01 0A 07 08"	= "Adresář veřejného klíče";
"06 07 02 82 06 01 0A 07 09"	= "Bezpečnostní doména";
"06 07 02 82 06 01 0A 07 0A"	= "Předmět";
"06 07 02 82 06 01 0A 07 0B"	= "Čas revokace";
"06 07 02 82 06 01 0A 07 0C"	= "Reference uživatelské skupiny";
"06 07 02 82 06 01 0A 07 0D"	= "Platnost";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Prostředí zabezpečení zpráv";
"06 07 02 82 06 01 0A 07 10"	= "Anonymizovaný adresář veřejného klíče";
"06 07 02 82 06 01 0A 07 11"	= "Křestní jméno Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Přidání jména";
"06 07 02 82 06 01 0A 07 13"	= "PSČ Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Rozlišovatel jména";
"06 07 02 82 06 01 0A 07 15"	= "Seznam certifikátů Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Seznam certifikátů Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Seznam certifikátů X.509";
"06 07 02 82 06 01 0A 07 18"	= "Čas vydání";
"06 07 02 82 06 01 0A 07 19"	= "Fyzické číslo karty";
"06 07 02 82 06 01 0A 07 1A"	= "Typ souboru";
"06 07 02 82 06 01 0A 07 1B"	= "Soubor Ctl je archiv";
"06 07 02 82 06 01 0A 07 1C"	= "E-mailová adresa";
"06 07 02 82 06 01 0A 07 1D"	= "Seznam šablon certifikátů";
"06 07 02 82 06 01 0A 07 1E"	= "Název adresáře";
"06 07 02 82 06 01 0A 07 1F"	= "Název typu adresáře";
"06 07 02 82 06 01 0A 07 20"	= "Název skupiny adresářů";
"06 07 02 82 06 01 0A 07 21"	= "Jméno uživatele adresáře";
"06 07 02 82 06 01 0A 07 22"	= "Příznak revokace";
"06 07 02 82 06 01 0A 07 23"	= "Jméno záznamu symetrického klíče";
"06 07 02 82 06 01 0A 07 24"	= "Číslo GL";
"06 07 02 82 06 01 0A 07 25"	= "Číslo GO";
"06 07 02 82 06 01 0A 07 26"	= "Data G klíče";
"06 07 02 82 06 01 0A 07 27"	= "Data Z klíče";
"06 07 02 82 06 01 0A 07 28"	= "Data KT klíče";
"06 07 02 82 06 01 0A 07 2A"	= "Číslo KT klíče";
"06 07 02 82 06 01 0A 07 33"	= "Čas vygenerování revokace";
"06 07 02 82 06 01 0A 07 34"	= "Text odpovědnosti";

"06 06 02 82 06 01 0A 08"		= "Skupina atributů";
"06 06 02 82 06 01 0A 09"		= "Akce";
"06 06 02 82 06 01 0A 0A"		= "Sdělení";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Bezpečnostní aplikace";

"06 06 02 82 06 01 0A 0C"		= "Definice certifikace a doplňku CLR";

"06 07 02 82 06 01 0A 0C 00"	= "Doplněk omezení odpovědnosti pro certifikační doplňky";
"06 07 02 82 06 01 0A 0C 01"	= "Doplněk ID certifikátu Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Identifikátor pravidel Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID kvalifikátoru pravidel Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Filtrovaný doplněk CRL Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Doplněk filtrování CRL Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Doplněk pojmenovací autority Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID uživatele";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Poštovní schránka RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Komponenta domény";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "ABN (Australian Business Number)";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Identifikátor certifikačních pravidel Austrálie";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Identifikátor pravidel Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Symetrický šifrovací algoritmus";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Identifikátor pravidel přísného zajištění SEIS";
"06 06 2A 85 70 22 01 02"	= "Identifikátor pravidel SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Osobní identifikátor SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Modul ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Správa certifikátů X9F1";
"06 06 2A 86 48 CE 38 02"		= "Instrukce pozastavení";
"06 07 2A 86 48 CE 38 02 01"	= "Instrukce pozastavení-žádná";
"06 07 2A 86 48 CE 38 02 02"	= "Volat vydavatele";
"06 07 2A 86 48 CE 38 02 03"	= "Odmítnout";
"06 07 2A 86 48 CE 38 02 04"	= "Pickup Token";
"06 06 2A 86 48 CE 38 03"		= "Atribut";
"06 06 2A 86 48 CE 38 03 01"	= "Protipodpis";
"06 06 2A 86 48 CE 38 03 02"	= "Atributový certifikát";
"06 06 2A 86 48 CE 38 04"		= "Algoritmus";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Shoda DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA s SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Typ pole ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Prime Field";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Nulová báze";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomická báze";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomická báze";
"06 06 2A 86 48 CE 3D 02"		= "Typ veřejného klíče";
"06 07 2A 86 48 CE 3D 02 01"	= "Veřejný klíč na bázi eliptické křivky";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Typ pole ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Galois Field Prime";
"06 06 2A 86 48 CE 3E 02"		= "Typ čísla";
"06 07 2A 86 48 CE 3E 02 01"	= "Veřejný klíč Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Schéma";
"06 07 2A 86 48 CE 3E 03 01"	= "Statický Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 02"	= "Přechodný Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 03"	= "Hybridní Diffie-Hellman 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Hybridní Diffie-Hellman 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Info o verzi Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE s MD5 a CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC na bázi hesla";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Uživatel Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Entrust CA info";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Atributový certifikát";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Šifrování RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Šifrování RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Šifrování RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP Label Specified";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Schéma podpisu RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 se šifrováním RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 se šifrováním RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Šifrování BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Dohoda o klíči Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE s MD2 a DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE s MD5 a DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE s MD2 a RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE s MD5 a RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE s MD5 a XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE s SHA a DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Data";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Podepsaná data";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Data v obálce";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Podepsaná a zaobálkovaná data";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Abstrahovaná data";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Šifrovaná data";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Data s atributy";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Informace o šifrovaném privátním klíči";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "E-mailová adresa";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nestrukturovaný název";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Typ obsahu";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Abstrakt zprávy";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Čas podepisování";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Protipodpis";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Zabezpečovací heslo";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Nestrukturovaná adresa";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Rozšířené certifikátové atributy";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Vydavatel a sériové číslo";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Kontrola hesla";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Veřejný klíč";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Popis podepisování";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Požadavek doplňku";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Možnosti S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Preferovat podepsaná data";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Nic nelze dešifrovat";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Požadavek předpisu";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Předpis";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Nápovědy obsahu";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Historie expanze seznamu pošty";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Moduly S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Syntax kryptografické zprávy";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Zesílené zabezpečovací služby";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Identifikátor objektu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Zpráva S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Elektronický podpis ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Elektronický podpis ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Pravidla elektronického podpisu ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Pravidla elektronického podpisu ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Typy obsahu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Ověřené atributy S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritmy S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Distribuce certifikátu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Certifikační distribuce LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Kvalifikátor pravidel podpisu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Identifikátor typu podpisu S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Podpis původce";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Podpis domény";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Podpis dodatečných atributů";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Prohlédnout podpis";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Možnosti S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Preferovat binární obsah";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Přátelský název (for PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID místního klíče (pro PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Typy certifikátů (pro PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Certifikát X.509 (pro PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Certifikát SDSI (pro PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Typy CRL (pro PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (pro PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Syntax výměny osobních údajů PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID šifrování na bázi hesla PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE s SHA-1 a 128bitovým RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE s SHA-1 a 40bitovým RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE s SHA-1 a 3-klíčovým Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE s SHA-1 a 2-klíčovým Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE s SHA-1 a 128bitovým RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE s SHA-1 a 40bitovým RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Krytí klíče PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID kontejnerů PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID kontejneru klíče PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ID kontejneru certifikátu a CLR PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID tajného kontejneru PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID bezpečného obsahu PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "ID kontejneru krytého klíče PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID kontejneru certifikátu PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID kontejneru certifikátu a CLR PKCS-12 X.509";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID kontejneru certifikátu PKCS-12 SDSI";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID šifrování na bázi hesel PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE s SHA-1 a 128bitovým RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE s SHA-1 a 40bitovým RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE s SHA-1 a Triple DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE s SHA-1 a 128bitovým RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE s SHA-1 a 40bitovým RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE s SHA-1 a RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE s SHA-1 a RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID obálek PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Šifrování PKCS-12 RSA se 128bitovým RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Šifrování PKCS-12 RSA s 40bitovým RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Šifrování PKCS-12 RSA s Triple DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID podpisu PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Podpis PKCS-12 RSA s abstraktem SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 verze 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID kontejnerů PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Kontejner klíče PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Kontejner krytého klíče PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Kontejner certifikátu PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Kontejner PKCS-12 CRL";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Tajný kontejner PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Bag bezpečného obsahu PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Moduly PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Atributy PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Typ obsahu PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Obsah PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritmus abstraktu RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC s SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Šifrovací algoritmus RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 s MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identifikátor neznámých pravidel Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Objektová třída Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Addressing";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Schéma tříd";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Schéma atributů";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Poštovní schránka";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Kontejner";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Příjemce pošty";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Způsob dodání";

"06 07 2A 86 48 86 F7 14 04"				= "Souborové formáty Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Nepřímý datový kontext SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Info agentury SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Typ prohlášení SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "SPC Opus info";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Doplňky certifikátu SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Data bitové kopie SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Propojení SPC (typ 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Podepisování individuálního kódu";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Podepisování komerčního kódu";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Propojení SPC (typ 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Minimální kritéria SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Finanční kritéria SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Propojení SPC (typ 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Poskytovatel podpory zabezpečení NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Protipodpis časové značky";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Seznam důvěryhodných certifikátů";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Tříděný doplněk CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Umístění další aktualizace";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Zesílené využití klíče";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Podepisování seznamu důvěryhodných certifikátů";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Podepisování časové značky";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "SGC (Server Gated Crypto)";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Serializované šifrování";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Šifrované souborové systémy";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Zotavení šifrovaných souborových systémů";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Kompatibilní s Windows Hardware";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Podepisování NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Podepisování Windows Hardware OEM";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Vložené podepisování NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Podepisování důvěryhodného kořenového seznamu";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Kvalifikované podřízení";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Zotavení klíče";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Podepisování dokumentů";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Objektové identifikátory atributů";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Atribut důvěryhodnosti Ano/Ne";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Individualizace Microsoft DRM";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Licence Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft License Server";

"06 08 2B 06 01 04 01 82 37 0D"				= "Identifikátory objektů Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Certifikát obměny";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Registrační pár Jméno/Hodnota";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Registrace CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Verze OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Atributy Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Místní sada klíčů";

"06 08 2B 06 01 04 01 82 37 14"				= "Infrastruktura registrace Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Užití automatické registrace CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Typ registračního certifikátu";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Registrační agent";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Přihlášení Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Název zaregistrovaného objektu zabezpečení NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Infrastruktura certifikátového serveru Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Verze obměny CA Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Verze CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Atribut CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Název dokumentu";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Popis dokumentu";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Šifrovaná data";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Šifrovaný obsah";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Identifikátor pravidel UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Identifikátor pravidel ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Identifikátor pravidel CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal s SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal s RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Atributy cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Kontrola přítomnosti cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "Odpověď OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Odpověď OCSP rozšířeného RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Rozšířený důvod CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Funkce klíče";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Obsah cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Konfigurační data cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Uživatelský index cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Uživatelské info cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Identifikátor pravidel XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Systém časových značek";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Time Signature System 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Time Signature System 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Time Signature System 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Sekundární postupy";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Lékařské identifikátory";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Data ověření totožnosti Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Data klíče Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "Data odpovědního klíče Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Ověření totožnosti klienta Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos KDC (Key Distribution Center)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "SPKM (Simple Public Key Mechanism)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastruktura veřejného klíče";

"06 07 2B 06 01 05 05 07 01"		= "Doplňky privátního certifikátu PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Přístup k informacím certifikační autority";
"06 08 2B 06 01 05 05 07 01 02"		= "Biometrické údaje";
"06 08 2B 06 01 05 05 07 01 03"		= "Kvalifikovaná prohlášení certifikátu";
"06 08 2B 06 01 05 05 07 01 04"		= "Identita auditu atributového certifikátu";
"06 08 2B 06 01 05 05 07 01 05"		= "Zacílení atributového certifikátu";
"06 08 2B 06 01 05 05 07 01 06"		= "Řízení autority atributového certifikátu";
"06 08 2B 06 01 05 05 07 01 07"		= "Blok adresy SBGP IP";
"06 08 2B 06 01 05 05 07 01 08"		= "Anonymní identifikátor systému SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Identifikátor routeru SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proxy atributového certifikátu";
"06 08 2B 06 01 05 05 07 01 0B"		= "Přístup k informacím subjektu";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Typy kvalifikátorů pravidel";
"06 08 2B 06 01 05 05 07 02 01"		= "Prohlášení o metodách certifikace";
"06 08 2B 06 01 05 05 07 02 02"		= "Uživatelské hlášení";
"06 08 2B 06 01 05 05 07 02 03"		= "Textové hlášení";

"06 07 2B 06 01 05 05 07 03"		= "Účel klíče";
"06 08 2B 06 01 05 05 07 03 01"		= "Ověření totožnosti serveru";
"06 08 2B 06 01 05 05 07 03 02"		= "Ověření totožnosti klienta";
"06 08 2B 06 01 05 05 07 03 03"		= "Podepisování kódu";
"06 08 2B 06 01 05 05 07 03 04"		= "Ochrana e-mailu";
"06 08 2B 06 01 05 05 07 03 05"		= "Koncový systém IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Tunel IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Uživatel IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Časové značkování";
"06 08 2B 06 01 05 05 07 03 09"		= "Podepisování OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Ověření totožnosti serveru SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Informační typy CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Šifrovací certifikát protokolu CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Typy párového klíče podepisování";
"06 08 2B 06 01 05 05 07 04 03"		= "Typy párových šifrovacích klíčů";
"06 08 2B 06 01 05 05 07 04 04"		= "Preferovaný symetrický algoritmus";
"06 08 2B 06 01 05 05 07 04 05"		= "Info o aktualizaci klíče CA";
"06 08 2B 06 01 05 05 07 04 06"		= "Aktuální CRL";
"06 08 2B 06 01 05 05 07 04 07"		= "Nepodporovaná OID";
"06 08 2B 06 01 05 05 07 04 08"		= "Požadavek na odběr";
"06 08 2B 06 01 05 05 07 04 09"		= "Odpověď odběru";
"06 08 2B 06 01 05 05 07 04 0A"		= "Požadavek parametrů párového klíče";
"06 08 2B 06 01 05 05 07 04 0B"		= "Odpověď parametrů párového klíče";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Registrace CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Řízení registrace";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Registrační token";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Autentikátor";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Publikační info PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Volby archivu PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID starého certifikátu";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Klíč šifrování protokolu";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Alternativní šablona certifikátu";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Šablona WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Registrační info CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Páry UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Certifikační požadavek";

"06 07 2B 06 01 05 05 07 06"		= "Algoritmy";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Žádný podpis";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Řízení CMC";

"06 07 2B 06 01 05 05 07 08"		= "Jiné názvy";
"06 08 2B 06 01 05 05 07 08 01"		= "Osobní data";
"06 08 2B 06 01 05 05 07 08 02"		= "Uživatelská skupina";

"06 07 2B 06 01 05 05 07 09"		= "Osobní data";
"06 08 2B 06 01 05 05 07 09 01"		= "Datum narození";
"06 08 2B 06 01 05 05 07 09 02"		= "Místo narození";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Rod";
"06 08 2B 06 01 05 05 07 09 05"		= "Země občanství";
"06 08 2B 06 01 05 05 07 09 06"		= "Země pobytu";

"06 07 2B 06 01 05 05 07 0A"		= "Atributový certifikát";
"06 08 2B 06 01 05 05 07 0A 01"		= "Údaje ověření totožnosti";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identita přístupu";
"06 08 2B 06 01 05 05 07 0A 03"		= "Platební identita";
"06 08 2B 06 01 05 05 07 0A 04"		= "Skupina";
"06 08 2B 06 01 05 05 07 0A 05"		= "Role";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Protokol OCSP";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Základní odpověď OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Doplněk OCSP nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Reference OCSP CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Odpověď OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "OCSP bez kontroly odvolání";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Odstavení archivu OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Lokátor služby OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Vydavatelé CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Časové značkování";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "Intermediální IKE";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Šifrovací algoritmus DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Hašovací algoritmus DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritmus podpisu DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 s RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 s RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 s RSA";
"06 05 2B 0E 03 02 03"				= "MD5 s RSA";
"06 05 2B 0E 03 02 04"				= "MD4 se šifrováním RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N s RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Podpis RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA s SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 s podpisem RSA";
"06 05 2B 0E 03 02 0F"				= "SHA s podpisem RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman se společným modulem";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "Obecný DSA";
"06 05 2B 0E 03 02 15"				= "Obecný DSA s SHA";
"06 05 2B 0E 03 02 16"				= "Transport klíče RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 s podpisem RSA";
"06 05 2B 0E 03 02 19"				= "MD5 s podpisem RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA s SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA s obecným SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 se šifrováním RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 s RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 s ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokument";
"06 04 2B 24 01 01"					= "Finální verze";
"06 04 2B 24 01 02"					= "Draft";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritmus";
"06 04 2B 24 03 01"					= "Šifrovací algoritmus";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Šifrování RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Hašovací algoritmus";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 s jednoduchou délkou";
"06 05 2B 24 03 02 05"				= "MDC2 s dvojitou délkou";
"06 04 2B 24 03 03"					= "Algoritmus podpisu";
"06 05 2B 24 03 03 01"				= "Podpis RSA";

"06 06 2B 24 03 03 01 01"			= "Podpis RSA s SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Podpis RSA s SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Podpis RSA s SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Podpis RSA s SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Podpis RSA s SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Podpis RSA s SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Podpis RSA s SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Podpis RSA s SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Podpis RSA s SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Podpis RSA s SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Podpis RSA s SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Podpis RSA s SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Podpis RSA s SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Podpis RSA s SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Podpis RSA s SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Podpis RSA s SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Podpis RSA s SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Podpis RSA s SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Podpis RSA s SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Podpis RSA s SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Podpis RSA s SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Podpis RSA s SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Podpis RSA s SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Podpis RSA s SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Podpis RSA s SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Podpis RSA s SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Podpis RSA s RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Podpis RSA s RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Podpis RSA s RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Podpis RSA s RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Podpis RSA s RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Podpis RSA s RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Podpis RSA s RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Podpis RSA s RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Podpis RSA s RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Podpis RSA s RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Podpis RSA s RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Podpis RSA s RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Podpis RSA s RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Podpis RSA s RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Podpis RSA s RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Podpis RSA s RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Podpis RSA s RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Podpis RSA s RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Podpis RSA s RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Podpis RSA s RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Podpis RSA s RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Podpis RSA s RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Podpis RSA s RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Podpis RSA s RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Podpis RSA s RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Podpis RSA s RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Podpis RSA s RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Podpis RSA s RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Podpis ECSIE";
"06 06 2B 24 03 03 02 01"			= "Podpis ECSIE s SHA-1";
"06 06 2B 24 03 03 02 02"			= "Podpis ECSIE s RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Podpis ECSIE s MD2";
"06 06 2B 24 03 03 02 04"			= "Podpis ECSIE s MD5";

"06 04 2B 24 03 04"					= "Schéma podpisu";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 s RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 s RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 s RND";

"06 03 2B 24 04"					= "Atribut";
"06 03 2B 24 05"					= "Pravidla";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Specifické API výrobce";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Funkčně specifické API";
"06 03 2B 24 07"					= "Správa klíče";
"06 04 2B 24 07 01"					= "Dohoda o klíči";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Přenos klíče";
"06 05 2B 24 07 02 01"				= "ISO9796-2 se šifrováním RSA";

"06 05 2B 24 08 01 01"				= "Identifikátor pravidel Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Adresářová služba";

"06 05 2B 24 08 03 01"				= "Datum generování certifikátu";
"06 05 2B 24 08 03 02"				= "Zplnomocnění";
"06 05 2B 24 08 03 03"				= "Přijetí";
"06 05 2B 24 08 03 04"				= "Peněžní limit";
"06 05 2B 24 08 03 05"				= "Prohlášení zletilosti";
"06 05 2B 24 08 03 06"				= "Sériové číslo karty";
"06 05 2B 24 08 03 07"				= "Reference veřejného klíče";
"06 05 2B 24 08 03 08"				= "Omezení";
"06 05 2B 24 08 03 09"				= "Vyzvednout je-li povoleno";
"06 05 2B 24 08 03 0A"				= "Požadovaný certifikát";
"06 05 2B 24 08 03 0B"				= "Pojmenovací autority";
"06 05 2B 24 08 03 0C"				= "Certifikát v adresáři od";
"06 05 2B 24 08 03 0D"				= "Hašování certifikátu";

"06 05 2B 24 08 04 01"				= "Osobní data";
"06 05 2B 24 08 04 08"				= "Omezení";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA s SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA s RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "Rozšířený DSA";
"06 07 2B 24 08 05 01 02 02"		= "DSA s RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Certifikát";
"06 05 2B 24 08 06 02"				= "Reference certifikátu";
"06 05 2B 24 08 06 03"				= "Atributový certifikát";
"06 05 2B 24 08 06 04"				= "Reference atributů";
"06 05 2B 24 08 06 05"				= "Název souboru";
"06 05 2B 24 08 06 06"				= "Čas uložení";
"06 05 2B 24 08 06 07"				= "Velikost souboru";
"06 05 2B 24 08 06 08"				= "Poloha";
"06 05 2B 24 08 06 09"				= "Číslo podpisu";
"06 05 2B 24 08 06 0A"				= "Vytvořeno automaticky";

"06 05 2B 24 08 07 01"				= "Prezentační typy Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binární kód";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Draw";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Text";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Doplněk certifikátu Thawte";
"06 05 2B 65 01 04 01"				= "Strong Extranet";

/* X.520 */

"06 02 55 04"		= "Typy atributů X.520";
"06 03 55 04 00"	= "Objektová třída";
"06 03 55 04 01"	= "Aliasovaný název záznamu";
"06 03 55 04 02"	= "Znalostní informace";
"06 03 55 04 03"	= "Obecný název";
"06 03 55 04 04"	= "Příjmení";
"06 03 55 04 05"	= "Sériové číslo";
"06 03 55 04 06"	= "Název země";
"06 03 55 04 07"	= "Název lokality";
"06 04 55 04 07 01"	= "Kolektivní název lokality";
"06 03 55 04 08"	= "Název státu nebo kraje";
"06 04 55 04 08 01"	= "Kolektivní název státu nebo kraje";
"06 03 55 04 09"	= "Domovní adresa";
"06 04 55 04 09 01"	= "Kolektivní domovní adresa";
"06 03 55 04 0A"	= "Název organizace";
"06 04 55 04 0A 01"	= "Kolektivní název organizace";
"06 03 55 04 0B"	= "Název jednotky organizace";
"06 04 55 04 0B 01"	= "Kolektivní název jednotky organizace";
"06 03 55 04 0C"	= "Titul";
"06 03 55 04 0D"	= "Popis";
"06 03 55 04 0E"	= "Průvodce hledáním";
"06 03 55 04 0F"	= "Kategorie podnikání";
"06 03 55 04 10"	= "Poštovní adresa";
"06 04 55 04 10 01"	= "Kolektivní poštovní adresa";
"06 03 55 04 11"	= "PSČ";
"06 04 55 04 11 01"	= "Kolektivní PSČ";
"06 03 55 04 12"	= "PO BOX";
"06 04 55 04 12 01"	= "Kolektivní PO Box";
"06 03 55 04 13"	= "Název fyzického doručovacího úřadu";
"06 04 55 04 13 01"	= "Kolektivní název doručovacího úřadu";
"06 03 55 04 14"	= "Telefonní číslo";
"06 04 55 04 14 01"	= "Kolektivní telefonní číslo";
"06 03 55 04 15"	= "Telexové číslo";
"06 04 55 04 15 01"	= "Kolektivní číslo telexu";
"06 03 55 04 16"	= "Identifikátor telexového terminálu";
"06 04 55 04 16 01"	= "kolektivní identifikátor telexového terminálu";
"06 03 55 04 17"	= "Telefonní číslo faxu";
"06 04 55 04 17 01"	= "Kolektivní telefonní číslo faxu";
"06 03 55 04 18"	= "Adresa X.121";
"06 03 55 04 19"	= "Mezinárodní číslo ISDN";
"06 04 55 04 19 01"	= "Kolektivní mezinárodní číslo ISDN";
"06 03 55 04 1A"	= "Registrovaná adresa";
"06 03 55 04 1B"	= "Indikátor destinace";
"06 03 55 04 1C"	= "Preferovaná metoda doručení";
"06 03 55 04 1D"	= "Prezentační adresa";
"06 03 55 04 1E"	= "Podporovaný aplikační kontext";
"06 03 55 04 1F"	= "Člen";
"06 03 55 04 20"	= "Majitel";
"06 03 55 04 21"	= "Držitel role";
"06 03 55 04 22"	= "Viz též";
"06 03 55 04 23"	= "Uživatelské heslo";
"06 03 55 04 24"	= "Uživatelský certifikát";
"06 03 55 04 25"	= "Certifikát CA";
"06 03 55 04 26"	= "Seznam revokací autority";
"06 03 55 04 27"	= "Seznam revokovaných certifikátů";
"06 03 55 04 28"	= "Křížový pár certifikátů";
"06 03 55 04 29"	= "Jméno";
"06 03 55 04 2A"	= "Křestní jméno";
"06 03 55 04 2B"	= "Iniciály";
"06 03 55 04 2C"	= "Kvalifikátor generace";
"06 03 55 04 2D"	= "Jedinečný identifikátor";
"06 03 55 04 2E"	= "DN kvalifikátor";
"06 03 55 04 2F"	= "Zesílený průvodce hledáním";
"06 03 55 04 30"	= "Informace o protokolu";
"06 03 55 04 31"	= "Jedinečný název";
"06 03 55 04 32"	= "Jedinečný člen";
"06 03 55 04 33"	= "Domovní identifikátor";
"06 03 55 04 34"	= "Podporované algoritmy";
"06 03 55 04 35"	= "Rozdílový seznam revokací";
"06 03 55 04 36"	= "Prověření";
"06 03 55 04 3A"	= "Křížový pár certifikátů";

/* X.500 object classes */

"06 02 55 06"		= "Objektová třída X.520";
"06 03 55 06 00"	= "Top";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Země";
"06 03 55 06 03"	= "Lokalita";
"06 03 55 06 04"	= "Organizace";
"06 03 55 06 05"	= "Jednotka organizace";
"06 03 55 06 06"	= "Osoba";
"06 03 55 06 07"	= "Člen organizace";
"06 03 55 06 08"	= "Role v organizaci";
"06 03 55 06 09"	= "Skupina jmen";
"06 03 55 06 0A"	= "Rezidenční osoba";
"06 03 55 06 0B"	= "Proces aplikace";
"06 03 55 06 0C"	= "Aplikační entita";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Zařízení";
"06 03 55 06 0F"	= "Uživatel odolného ověření totožnosti";
"06 03 55 06 10"	= "Certifikační autorita";
"06 03 55 06 11"	= "Skupina jedinečných jmen";
"06 03 55 06 15"	= "Uživatel PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritmy X.500";
"06 03 55 08 01"	= "Šifrovací algoritmus X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Doplňky certifikátu X.509";
"06 03 55 1D 01"	= "Identifikátor klíče autority (starý)";
"06 03 55 1D 02"	= "Primární atributy klíče (staré)";
"06 03 55 1D 03"	= "Certifikační pravidla (stará)";
"06 03 55 1D 04"	= "Omezení použití klíče (staré)";
"06 03 55 1D 05"	= "Mapování pravidel (staré)";
"06 03 55 1D 06"	= "Omezení podstromů";
"06 03 55 1D 07"	= "Alternativní název subjektu (původní)";
"06 03 55 1D 08"	= "Alternativní název vydavatele (původní)";
"06 03 55 1D 09"	= "Atributy adresáře subjektu";
"06 03 55 1D 0A"	= "Základní omezení (stará 2.5.29.10)";
"06 03 55 1D 0B"	= "Omezení jmen (stará)";
"06 03 55 1D 0C"	= "Omezení pravidel (stará)";
"06 03 55 1D 0D"	= "Základní omezení (stará 2.5.29.13)";
"06 03 55 1D 0E"	= "Identifikátor klíče subjektu";
"06 03 55 1D 0F"	= "Použití klíče";
"06 03 55 1D 10"	= "Doba používání privátního klíče";
"06 03 55 1D 11"	= "Alternativní název subjektu";
"06 03 55 1D 12"	= "Alternativní název vydavatele";
"06 03 55 1D 13"	= "Základní omezení";
"06 03 55 1D 14"	= "Číslo seznamu revokovaných certifikátů";
"06 03 55 1D 15"	= "Kód důvodu CLR";
"06 03 55 1D 16"	= "Datum vypršení (staré)";
"06 03 55 1D 17"	= "Kód instrukce pozastavení";
"06 03 55 1D 18"	= "Datum neplatnosti";
"06 03 55 1D 19"	= "Distribuční místa CLR (stará)";
"06 03 55 1D 1A"	= "Vydavatelský distribuční bod (starý)";
"06 03 55 1D 1B"	= "Rozdílový indikátor CRL";
"06 03 55 1D 1C"	= "Vydavatelský distribuční bod";
"06 03 55 1D 1D"	= "Vydavatel certifikátu";
"06 03 55 1D 1E"	= "Omezení jmen";
"06 03 55 1D 1F"	= "Distribuční místa CLR";
"06 03 55 1D 20"	= "Certifikační pravidla";
"06 04 55 1D 20 00"	= "Libovolný identifikátor pravidel";
"06 03 55 1D 21"	= "Mapování pravidel";
"06 03 55 1D 22"	= "Omezení pravidel";
"06 03 55 1D 23"	= "Identifikátor klíče autority";
"06 03 55 1D 24"	= "Omezení pravidel";
"06 03 55 1D 25"	= "Rozšířené použití klíče";
"06 04 55 1D 25 00"	= "Libovolné rozšířené použití klíče";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritmus podpisu SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritmus podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritmus důvěrnosti SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritmus důvěrnosti Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritmus integrity SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritmus integrity Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritmus ochrany pro SDNS token";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritmus ochrany pro Fortezza token";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritmus správy klíčů SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritmus správy klíčů Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritmus správy klíčů a podpisů SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritmus správy klíčů a podpisů Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritmus podpisu Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritmus důvěrnosti Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritmus integrity Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritmus ochrany pro Suite A token";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritmus správy klíčů Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritmus správy klíčů a podpisů Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Aktualizovaný algoritmus podpisu Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritmy správy klíčů a aktualizovaných podpisů Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Aktualizovaný algoritmus integrity Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritmus výměny klíčů";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritmus Fortezza Wrap80";
"06 09 60 86 48 01 65 02 01 01 18"	= "KEA (Key Encryption Algorithm)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Formát zprávy RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Prázdný obsah";
"06 09 60 86 48 01 65 02 01 02 03"	= "Typ obsahu CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Typ obsahu MSP rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Typ obsahu MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protokol agenta MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Typ obsahu MSP rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Část těla přeposlané zprávy MSP";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parametry přeposlané zprávy MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Část těla přeposlané zprávy CSP";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parametry přeposlané zprávy CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Pravidla zabezpečení SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Pravidla zabezpečení";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Obecný";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Výchozí pravidla zabezpečení";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Certifikát správy klíčů SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Certifikát podpisu uživatele SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Certifikát správy klíčů a podpisů SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Certifikát správy klíčů Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Certifikát správy klíčů a podpisů Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Certifikát podpisu uživatele Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Certifikát podpisu CA Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Certifikát podpisu CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Pomocný vektor";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Pravidla předpisu";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Členství";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Správci";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL podpisu Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL podpisu SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Seznam revokovaných certifikátů SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Seznam revokovaných certifikátů Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Exempted Address Processor";
"06 09 60 86 48 01 65 02 01 05 30"	= "Guard";
"06 09 60 86 48 01 65 02 01 05 31"	= "Podporované algoritmy";
"06 09 60 86 48 01 65 02 01 05 32"	= "Certifikát správy klíčů Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Certifikát správy klíčů a podpisů Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Certifikát podpisu uživatele Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "PRBAC info";
"06 09 60 86 48 01 65 02 01 05 36"	= "Omezení CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Práva podpisu a správy klíče";
"06 09 60 86 48 01 65 02 01 05 38"	= "Obecná práva";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atribut s popiskem";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Informační soubor pravidel";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Informační soubor zabezpečovacích pravidel";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Omezení prověření CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Doplňky CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Kategorie zabezpečení ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Standardní práva zabezpečovací známky";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Práva podpisu";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Práva správy klíče";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Oprávnění pojmenované sady tagů";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "PKI Ministerstva obrany USA třída 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "PKI Ministerstva obrany USA třída 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "PKI Ministerstva obrany USA třída 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "PKI Ministerstva obrany USA třída 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "PKI Ministerstva obrany USA třída 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Test pravidel zabezpečení";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "Sada tagů TSP1 nula";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "Sada tagů TSP1 jedna";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "Sada tagů TSP1 dvě";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Kategorie zabezpečení TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "Sada tagů TSP2 nula";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "Sada tagů TSP2 jedna";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "Sada tagů TSP2 dvě";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kategorie zabezpečení Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Název sady tagů Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Název sady tagů Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Název sady tagů Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Test záznamu CLR";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Popisek";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Identifikátor pravidel GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Identifikátor rudimentárních pravidel FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Identifikátor základních pravidel FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Identifikátor středních pravidel FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Identifikátor přísných pravidel FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Klíč KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Doplňky";
"06 09 60 86 48 01 65 03 02 03 01"		= "Technika zotavení klíče";
"06 09 60 86 48 01 65 03 02 03 02"		= "Možnost zotavení klíče";
"06 09 60 86 48 01 65 03 02 03 03"		= "Zotavení klíče";
"06 08 60 86 48 01 65 03 02 04"			= "Schémata zotavení klíče";
"06 08 60 86 48 01 65 03 02 05"			= "Doplněk CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritmus NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritmus Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 se šifrováním RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 se šifrováním RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 se šifrováním RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM abstrakt";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC s SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC s MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Paket MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA šifrování BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Heslo NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Typ atributu PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Atributy zabezpečení";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Limit spolehlivosti";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Identifikátor objektu Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Doplněk certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Typ certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL báze Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL revokace Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL revokace CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL pro stažení CRL Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL pro stažení certifikátu CA Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL obměny certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL pravidel Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL domovské stránky certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo certifikační entity Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Obrázek uživatele certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Název Netscape SSL serveru";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Komentář certifikátu Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Datový typ Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "obrázek/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "obrázek/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "text/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Sekvence certifikátu Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL certifikátu Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Identifikátor objektu adresáře Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definice LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Licence na automobil";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Číslo oddělení";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Číslo zaměstnance";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Typ zaměstnance";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Intranetový člen organizace";

"06 09 60 86 48 01 86 F8 42 04 01"		= "SGC (Server Gated Crypto)";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Neznámý doplněk Verisign VPN";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Neznámý doplněk Verisign VPN";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Identifikátor pravidel Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Poznámka Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Typ obsahu";
"06 04 67 2A 00 00"	= "Data PAN";
"06 04 67 2A 00 01"	= "PAN token";
"06 04 67 2A 00 02"	= "Pouze PAN";

"06 03 67 2A 01"	= "Doplněk zprávy";
"06 03 67 2A 02"	= "Pole";
"06 04 67 2A 02 00"	= "Celé jméno";
"06 04 67 2A 02 01"	= "Křestní jméno";
"06 04 67 2A 02 02"	= "Příjmení";
"06 04 67 2A 02 03"	= "Rodné jméno";
"06 04 67 2A 02 04"	= "Název místa";
"06 04 67 2A 02 05"	= "Identifikační číslo";
"06 04 67 2A 02 06"	= "Měsíc";
"06 04 67 2A 02 07"	= "Datum";
"06 04 67 2A 02 08"	= "Adresa";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Množství";
"06 04 67 2A 02 0B"	= "Číslo účtu";
"06 04 67 2A 02 0C"	= "Heslo (fráze)";

"06 03 67 2A 03"		= "Atribut";
"06 04 67 2A 03 00"		= "Certifikát";
"06 05 67 2A 03 00 00"	= "Otisk palce kořenového klíče";
"06 05 67 2A 03 00 01"	= "Dodatečná pravidla";

"06 03 67 2A 04"	= "Algoritmus";
"06 03 67 2A 05"	= "Pravidla";
"06 04 67 2A 05 00"	= "Root";
"06 03 67 2A 06"	= "Modul";
"06 03 67 2A 07"	= "Doplněk certifikátu";
"06 04 67 2A 07 00"	= "Hašovaný kořenový klíč";
"06 04 67 2A 07 01"	= "Typ certifikátu";
"06 04 67 2A 07 02"	= "Data obchodníka";
"06 04 67 2A 07 03"	= "Požadována certifikace karty";
"06 04 67 2A 07 04"	= "Tunelování";
"06 04 67 2A 07 05"	= "Doplňky SET";
"06 04 67 2A 07 06"	= "Kvalifikátor SET";

"06 03 67 2A 08"	= "Značka";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Dodavatel";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Národní";
"06 05 67 2A 0A E2 00"	= "Japonsko";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Hašovaný kořenový klíč";
"06 04 86 8D 6F 03"	= "Typ certifikátu";
"06 04 86 8D 6F 04"	= "Data obchodníka";
"06 04 86 8D 6F 05"	= "Požadován certifikát karty";
"06 04 86 8D 6F 06"	= "Tunelování";
"06 04 86 8D 6F 07"	= "Kvalifikátor SET";
"06 04 86 8D 6F 63"	= "Data SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Zabezpečení dat Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Identifikátor pravidel důvěry Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Pravidla Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Základní pravidla Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Pravidla Apple SSL";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Pravidla lokálního generování certifikátu Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Pravidla lokálního generování Apple CSR";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Pravidla revokace Apple CLR";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Pravidla revokace Apple OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Pravidla Apple S/MIME";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Rozšiřitelná pravidla ověření totožnosti Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Pravidla podepisování aktualizace software Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Pravidla Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Pravidla Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Pravidla podepisování prostředku Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Pravidla Apple Kerberos Client";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Pravidla Apple Kerberos Server";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Pravidla podepisování kódu Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Zásady podepisování balíčků Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Identifikátor zabezpečovacího algoritmu Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "FEE (Fast Elliptic Encryption)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "ASC (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE s podpisem MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE s podpisem SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Šifrování Apple FEED";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (experimentální)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE s podpisem ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Identifikátor certifikátu Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Žádost o certifikát Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Žádost o certifikát identity Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Žádost o certifikát podepisování e-mailu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Žádost o šifrovací certifikát e-mailu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Požadavek seznamu archivu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Požadavek uložení archivu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Požadavek načtení archivu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Požadavek odstranění archivu Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Doplněk certifikátu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Identita Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Podepisování e-mailu Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Šifrování e-mailu Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Stav žádosti o certifikát Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Uživatel";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Heslo";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Název hostitele";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Příznak obnovy";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Asynchronní příznak";

"06 08 2A 86 48 86 F7 63 64 04" = "Rozšířené použití klíče Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Podepisování kódu Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Podepisování kódu Apple (vývoj)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Podepisování aktualizace software Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Podepisování kódu Apple (vyhrazeno)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Podepisování prostředku Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Podepisování Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Šifrování Apple iChat";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Systémová identita Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Certifikační pravidla Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Certifikační pravidla Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Certifikační pravidla Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Podepisování kódu";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Zabezpečení CDSA Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Formáty zabezpečení Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Doplňky certifikátu X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Privátní doplňky certifikátu X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Bitová mapa podpisu subjektu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Obrázek subjektu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "E-mailová adresa subjektu";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Použít výjimky";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritmy zabezpečení Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 s ECDSA";

/* end */
